app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `username` = 'new'
 LIMIT 1
---
    public function index()
    {
        // helper(['form']);
        // $rules = [
        //     'username' => 'required',
        //     'password' => 'required|min_length[6]',
        // ];

        // if (!$this->validate($rules)) return $this->fail($this->validator->getErrors());

        // instance model
        $model = new UserModel();

        $login = $this->request->getPost('login');

        if ($login) {

            // $user = $this->request->getPost('user');
            $user = $model->where('username', $this->request->getPost('user'))->first();