app/Controllers/Register.php

    public function index()
    {
        helper(['form']);
        $rules = [
            'username' => 'required|is_unique[users.username]',
            'password' => 'required|min_length[6]',
            'confirmpass' => 'matches[password]',
        ];

        if (!$this->validate($rules)) {
            return $this->fail($this->validator->getErrors());
        }

        $data = [
            'username' => $this->request->getVar('username'),
            'password' => password_hash($this->request->getVar('password'), PASSWORD_BCRYPT),
        ];
        // Call model buat instance
        $model = new UserModel();
        $register = $model->save($data);
---
INSERT INTO `users` (`username`, `password`) VALUES ('newakun', '$2y$10$sokMlNuPbEouK0Pf0mRAiuwXmNqfmeukZeFrJ.ghwGM/Rj9M5OrWy')